In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
   ....:      'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [5]:
df['one'] # select by column

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [6]:
df['one']['a']

1.0

In [7]:
df.loc['b'] # select by row label

one    2.0
two    2.0
Name: b, dtype: float64

In [8]:
df.iloc[2] # select by row index

one    3.0
two    3.0
Name: c, dtype: float64

In [9]:
df.loc[df['one']>1] # select row conditional SELECT * FROM DF WHERE ONE > 1

   one  two
b  2.0  2.0
c  3.0  3.0

In [10]:
df[df['one']>1] # same as before but shorter

   one  two
b  2.0  2.0
c  3.0  3.0

In [21]:
df[df['one']>1]['two'] # SELECT TWO FROM DF WHERE ONE > 1

b    2.0
c    3.0
Name: two, dtype: float64

In [11]:
#Transpose
df[:].T

       a    b    c    d
one  1.0  2.0  3.0  NaN
two  1.0  2.0  3.0  4.0